### A Pluto.jl notebook ###
# v0.14.1

using Markdown
using InteractiveUtils

# This Pluto notebook uses @bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of @bind gives bound variables a default value (instead of an error).
macro bind(def, element)
    quote
        local el = $(esc(element))
        global $(esc(def)) = Core.applicable(Base.get, el) ? Base.get(el) : missing
        el
    end
end

# ╔═╡ 7c66daef-3998-4357-9a69-4a663b48dff3
begin
	import Pkg
	using PlutoUI #Help Package for Pluto
	#Pkg.add("ControlSystems")
	#Pkg.add("Plots")
	using ControlSystems
	using Plots
	plotly()
end

# ╔═╡ 318d372e-95fe-11eb-290b-29323669eb61
md"# _Εισαγωγή στον αυτόματο Έλεγχο (8090) - Ασκήσεις - Ανάλυση Μεταβατικής Απόκρισης Συστημάτων_

#### Βασίλειος Καρυστινός ΥΔ
vkar@lme.ntua.gr"

# ╔═╡ 18718ccb-103a-41c5-bf3d-3bf79a08d686
md"Σε αυτό το Notebook παρουσιάζονται μερικά βασικά παραδείγματα απόκρισης συστημάτων $1^{ου}$ και $2^{ου}$ βαθμού με χρήση της Julia. Η βιβλιοθήκη που θα χρησιμοποιήσουμε είναι η [**`ControlSystems`**](https://juliacontrol.github.io/ControlSystems.jl/latest/). Αρχικά κατεβάζουμε και κάνουμε εγκατάσταση του μαζί με μερικά ακόμη χρήσιμα πακέτα"

# ╔═╡ 4db5ab98-4f6a-4f21-ac1a-a1905f4be399
md"## Μεταβατική Απόκριση Συστημάτων

Κατά την ανάλυση και σχεδίαση συστημάτων ελέγχου απαιτείται εκπλήρωση ορισμένων προδιαγραφών της δυναμικής απόκρισης των συστημάτων (ελεγκτής + φυσικό σύστημα). Καθώς δεν είναι γνωστά από πριν τα ακριβή σήματα εισόδου ενός συστήματος χρησιμοποιείται μια βάση σύγκρισης απόδοσης, η οποία επιτυγχάνεται όταν γίνεται χρήση σημάτων εισόδου δοκιμής με συγκεκριμένες προδιαγραφές.  

 
Σε αυτό το notebook θα γίνει μία εισαγωγή στην ανάλυση της απόκρισης συστημάτων σε απεριοδικά σήματα εισόδου δοκιμής, τα συνηθέστερα των οποίων είναι: 

* συνάρτηση βαθμίδας (step) 

$$r(t) = A, t>0 \Rightarrow \mathscr{L}\{r(t)\} = R(s) = \frac{A}{s}, t>0$$

* συνάρτηση αναρρίχησης (ramp)

$$r(t) = At, t>0 \Rightarrow \mathscr{L}\{r(t)\} = R(s) = \frac{A}{s^2}, t>0$$

* κρουστική συνάρτηση (pulse)

$$r(t) = 1/ε, 0\leq t \leq ε \Rightarrow \mathscr{L}\{r(t)\} = R(s) = 1, t>ε$$

* συνάρτηση παραβολής (parabolic)

$$r(t) = At^2, t>0 \Rightarrow \mathscr{L}\{r(t)\} = R(s) = \frac{A}{s^3}, t>0$$

$(Resource(\"https://i.imgur.com/ZaCsQDD.png\", :width => 500))

"

# ╔═╡ e82ebe78-9536-470d-a8cf-154bee32da4c
md" Υπενθυμίζεται ότι τα χαρακτηριστηκά τα οποία κυρίως θέλουμε να προσδιορίσουμε είναι:

* Απόλυτη ευστάθεια γραμμικού χρονικά αμετάβλητου συστήματος (Σε ισορροπία, Ευσταθές, Ασταθές)

* Σφάλμα μόνιμης κατάστασης

* Χρονική Απόκριση Συστήματος, μεταβατική απόκριση και απόκριση μόνιμης κατάστασης

"

# ╔═╡ 4c677fad-6579-4dcf-a2d6-891a7978a51b
md"
Στην συνέχεια του notebook παρουσιάζονται παραδείγματα ανάλυσης απόκρισης συστημάτων $1^{ου}$ και $2^{ου}$ βαθμού τόσο αναλυτικά όσο και με χρήση του πακέτου Control Systems 
"

# ╔═╡ 9a8462ea-aa6a-47a6-be45-3cbd2072a2aa
md" ### Απόκριση συστημάτων $1^{ης}$ τάξης

Ένα σύστημα 1ης τάξης έχει την εξής μορφή:

$$\frac{Y(s)}{R(s)} = \frac{1}{Ts+1}$$

Εάν θεωρήσουμε είσοδο μοναδιάιας βαθμίδας τότε προκύπτει: 

$$Y(s) = \frac{1}{Ts+1}R(s) = \frac{1}{Ts+1}\frac{1}{s}$$

και με αντίστροφο μετασχηματισμός Laplace:

$$y(t) = 1-e^{-t/T}, t \geq 0$$

Ενώ για t = T, έχουμε:

$$y(t) = 1-e^{-1} = 0.632$$

"

# ╔═╡ 7b98b638-3d5a-4c65-985a-7eb27a2afeca
md" #### Παράδειγμα 1

Βρείτε την απόκριση του συστήματος σε μοναδιάια είσοδο

$$G(s) = \frac{4}{s+4}$$

Λύση:

$$\frac{Y(s)}{R(s)} = \frac{3}{s+3} \Rightarrow \frac{1}{0.25s+1}\frac{1}{s}$$

$$\Rightarrow y(t) =  1-e^{-4t}$$

$$y(0.25) = 0.632$$

"


# ╔═╡ 64a367a6-a104-4564-8860-f958b942474f
begin
	G1 = tf([3],[1,3])
	stepplot(G1)
end

# ╔═╡ f0d06d98-8634-49b2-9190-9b06fda0699b
md" #### Παράδειγμα 2

Βρείτε την σταθερά Τ έτσι ώστε το παρακάτω συστημα να έχει χρόνο απόκρισης 5 sec, σε βηματική είσοδο.

$$G(s) = \frac{3}{Ts+4}$$

Λύση:

$$\frac{Y(s)}{R(s)} = \frac{3}{s+4} \Rightarrow \frac{3}{Τs+4}\frac{1}{s}$$

$$\Rightarrow \frac{3}{4}\frac{1}{(Τ/4)s+1}\frac{1}{s}$$

$$\Rightarrow y(t) = \frac{3}{4}(1-e^{-4t/T})$$

Για $t \rightarrow \infty \Rightarrow y \rightarrow 3/4$

$$y(5) = 0.98 \times 3/4 = \frac{3}{4}(1-e^{-20/T})$$

$$\Rightarrow T = 5.112 sec$$

"

# ╔═╡ 18c871fa-e8f2-46e3-a10c-f1f5c5e8498c
begin
	G2 = tf([3],[5.11244,4])
	stepplot(G2)
end

# ╔═╡ ea219fad-61fa-4239-ad2e-cfdca9614beb
md" ### Απόκριση συστημάτων $2^{ης}$ τάξης

Ένα σύστημα 2ης τάξης έχει την εξής μορφή:

$$\frac{Y(s)}{R(s)} = \frac{ω_n^2}{s^2+2ζω_n+ω_n^2}$$

Η χαρακτηριστική εξίσωση (θέτοντας τον παρονομαστή=0) είναι:

$$s^2+2ζω_n+ω_n^2 = 0$$

Οι ρίζες της χαρακτηριστικής εξίσωσης ονομάζονται πόλοι του συστήματος. Αντίστοιχα, σε περίπτωση ύπαρξης ριζών στον αριθμητή, αυτές ονομάζονται μηδενιστές. Τα $ω_n$ και $ζ$ περιγράφουν τη δυναμική συμπεριφορά συστημάτων 2ης τάξης. 

* Όταν 0 < ζ < 1, οι πόλοι κλειστού βρόχου είναι μιγαδικοί συζυγείς, και βρίσκονται στο αριστερό ημιεπίπεδο s. Το σύστημα λέγεται ότι έχει υπο-απόσβεση (underdamped) και η μεταβατική απόκριση είναι μια αποσβυνόμενη ταλάντωση. 

* Όταν ζ = 0, οι πόλοι κλειστού βρόχου είναι μιγαδικοί συζυγείς, και βρίσκονται στον άξονα των φανταστικών Im(s). Η μεταβατική απόκριση δεν καταστέλλεται αλλά ταλαντεύεται συνεχώς. 

* Όταν ζ = 1, το σύστημα λέγεται ότι έχει κρίσιμη απόσβεση (critically damped). 

* Όταν ζ > 1, το σύστημα λέγεται ότι έχει υπερ-απόσβεση (overdamped) και η μεταβατική απόκριση δεν έχει ταλάντωση 

#### Παράδειγμα 3

Θεωρούμε την παραπάνω συνάρτηση μεταφοράς, παρακάτω φαίνεται η απόκριση του συστήματος. Επιλέξτε τις σταθερές $ω_n$ και $ζ$ και δείτε την απόκριση της συνάρτησης μεταφοράς σε βηματική συνάρτηση.


**$ω_{n}$**  $(@bind ωn NumberField(0:100, default=10))

**$ζ$** 	$(@bind ζ NumberField(0:0.1:2, default=0.7))

"

# ╔═╡ 3aa013f5-c9df-44dc-8043-df98573e9db2
begin
	G = tf([ωn^2],[1, 2*ζ*ωn, ωn^2])
	stepplot(G)
end

# ╔═╡ 30fbbcb3-2a3d-4036-800b-d48477ff6713
md"#### Παράδειγμα 4
Θεωρούμε τη συνάρτηση μεταφοράς:

$$G(s) = \frac{2s+1}{s^2+3s+2} = \frac{2s+1}{(s+1)(s+2)} = \frac{-1}{s+1}+\frac{3}{s+2}$$

Οι πόλοι τηςG(s)είναι στο s = −1 και s = −2. Λαμβάνοντας αντίστροφο μετασχηματισμό Laplace, έχουμε για τη συνάρτηση g(t) στο χρόνο

$$h(t) = -e^{-t}+3e^{-2t},t\geq 0$$

Βλέπουμε ότι η μορφή της απόκρισης καθορίζεται από τη θέση των πόλων. Καθώς ο
όρος $e^{-2t}$ αποσβένεται γρηγορότερα από τον όρο $e^{-t}$, λέμε ότι ο πόλος στο -2 είναι ”πιo γρήγορος” από τον πόλο στο -1. Στο διάγραμμα πόλων-μηδενιστών, όσο πιο αριστερά βρίσκεται ένας πόλος, τόσο πιο γρήγορα αποσβένεται (πιο γρήγορος) σε σχέση με πόλο που βρίσκεται πιο δεξιά (πιο αργός). Σε περίπτωση πόλου με ύπαρξη μιγαδικού μέρους $(s = σ ± jω)$, η συμπεριφορά είναι ανάλογη των παραμέτρων σ, ω, εφόσον η απόκριση έχει τη μορφή $e^{+σt}cosωτ$.

"

# ╔═╡ 1cbfd3b9-3ac9-449e-adf3-582cdf89cdfe
G3 = tf([12, 1], [1, 3, 2])

# ╔═╡ 969b4e3b-2ead-4cb5-ab3c-2d39b602e3cf
stepplot(G3)

# ╔═╡ fc83cf82-d257-492b-9890-4b6586a38d4f
md"Για τους πόλους s1, s2, η γεωμετρική ερμηνεία των παραμέτρων σ (σταθερά εξασθένησης), ωn (φυσική συχνότητα χωρίς απόσβεση),ωd (αποσβυσμένη φυσική συχνότητα), ζ(λόγος απόσβεσης) φαίνεται στο διάγραμμα πόλων-μηδενιστών."

# ╔═╡ 96b1109e-a77b-4143-b184-857174f2d4a0
pzmap(G3)

# ╔═╡ ceee6016-70aa-467b-a6f9-257ae6f0655e
md"#### Παράδειγμα 5

Δίνεται η συνάρτηση μεταφοράς ηλεκτρικού κυκλώματος:

$$G(s) = \frac{0.5s}{s^2+30+10^6}$$

Θέλουμε να αναλύσουμε τη μεταβατική απόκριση.

Υπάρχει ένας μηδενιστής στη θέση z1 = 0. Υπάρχουν δύο πόλοι, που είναι οι λύσεις του πολυωνύμου της χαρακτηριστικής εξίσωσης $s^2+30s+10^6$. Εκφράζουμε τη χαρακτηριστική εξίσωση στη μορφή $s^2+2ζω_ns+ω_n^2$. Θεωρούμε $ω_n$ τη φυσική συχνότητα χωρίς απόσβεση (undamped natural frequency) και ζ το λόγο απόσβεσης (damping ratio).

Η παράμετρος $ζ$ ορίζει πόσο γρήγορα το μέτρο της απόκρισης του συστήματος χωρίς διέγερση αποσβένεται με το χρόνο. Οι ρίζες της χαρακτηριστικής εξίσωσης είναι

$$s_1,s_2 = ζω_n ± jω_n \sqrt{1-ζ^2}$$

Στο συγκεκριμένο παράδειγμα οι πόλοι είναι

$$p_{1,2} = -15 ±999.9j$$

που σημαίνει ότι η φυσική συχνότητα είναι $ω_n = 1000 rad/s$ και ο λόγος απόσβεσης είναι $ζ = 0.015$. Ο θετικός λόγος απόσβεσης δείχνει ότι το πλάτος της απόκρισης σε οποιαδήποτε είσοδο θα αποσβεστεί με το χρόνο λόγω της ύπαρξης του όρου

$$y_0e^{σt}e^{±jωt}$$

Ο παρακάτω κώδικας σε Julia κάνει τους σχετικούς υπολογισμούς και τυπώνειτις θέσεις των πόλων, μηδενιστών.
"

# ╔═╡ a4509589-3889-4144-bca3-a68e0bfd80fe
G5 = tf([0.5, 0], [1, 30, 10^6])

# ╔═╡ 04580cb4-2576-489e-b06a-fe8a2bf8e800
stepplot(G5)

# ╔═╡ 7f06bdd5-9d99-4e04-ad82-d9be2c7b1541
Wn3, zeta3, ps3 = damp(G5) # Returns freq, ζ, poles

# ╔═╡ 38e62cbb-706b-4015-bc57-0a05a2e49d76
with_terminal() do
	dampreport(G5)
end

# ╔═╡ 624c0572-fac2-4d9b-bfc2-fa737174ea72
pzmap(G5) #Pole zero map

# ╔═╡ a716a4bc-5994-4601-be34-2b1e96579900
md" ###  Προδιαγραφές Μεταβατικής Απόκρισης Βαθμίδας

Σε πολλές περιπτώσεις τα επιθυμητά χαρακτηριστικά συμπεριφοράς συστημάτων καθορίζονται στο πεδίο του χρόνου. Συχνά η συμπεριφορά συστημάτων ελέγχου προσδιορίζεται από την μεταβατική απόκριση σε είσοδο μοναδιαίας βαθμίδας, η οποία μπορεί να παραχθεί εύκολα και αντιπροσωπεύει μία δραστική μεταβολή της εισόδου. Τα συστήματα που συσσωρεύουν ενέργεια δεν μπορούν να ανταποκριθούν στιγμιαία σε διγέρσεις εισόδου ή διαταραχές αλλά εμφανίζουν μεταβατικά φαινόμενα. Η Μεταβατική Απόκριση Βαθμίδας εξαρτάται από τις αρχικές συνθήκες. Για διευκόλυνση, ως αρχική συνθήκη λαμβάνεται η ηρεμία του συστήματος, όπου η έξοδος και όλες οι παράγωγοι είναι μηδέν.

Τα χαρακτηριστικά κατά τη μεταβατική απόκριση φαίνονται στο παρακάτω σχήμα και περιγράφονται όπως παρακάτω.

$(Resource(\"https://i.imgur.com/TV4g3Wy.png\"))
"


# ╔═╡ 4636c254-5f4b-44f2-8c67-4145ca3891e5
md"

* χρόνος ανύψωσης (rise time) $t_r$: χρόνος που απαιτείται για να ανέλθει η απόκριση από 10% → 90% (για ζ > 1). Σε αυτή την περίπτωση είναι: 

$$t_r = \frac{1.8}{ω_n}$$


* χρόνος αποκατάστασης (settling time) $t_s$ : χρόνος που απαιτείται για να φτάσει και να παραμείνει η καμπύλη απόκρισης μέσα σε ορισμένα όρια(κριτήρια ζώνης) γύρω από την τελική τιμή (±5%, ±2%). Για κριτήριο ζώνης 2% έχουμε

$$e^{-ζω_n t_s} = 0.02  \Rightarrow t_s = 4/ζω_n$$

Για κριτήριο ζώνης 5% έχουμε

$$t_s = 3/ζω_n$$

* μέγιστη υπερακόντιση (maximum overshoot) $M_p$: είναι η τιμή της μέγιστης κορυφής της καμπύλης απόκρισης μετρούμενης από τη μονάδα. Αντιστοιχεί στον χρόνο κορυφής $t_p = π/ω_d$ και είναι

$$M_p = e^{-πζ/\sqrt{1-ζ^2}}, 0 \leq ζ \leq 1$$

Είναι απ’ ευθείας ένδειξη της σχετικής ευστάθειας του συστήματος εφοσον χαρακτηρίζειτην απόσβεση, η οποία παρέχει ένα μέτρο της ποιότητας της απόκρισης.

* χρόνος κορυφής (peak time) $t_p$: χρόνος που απαιτείται για να φτάσει η απόκρισηστην πρώτη κορυφή της καμπύλης.

* χρόνος καθυστέρησης (delay time) $t_d$: χρόνος που χρειάζεται για να φτάσει ηαπόκριση, για πρώτη φορά, στο 50% της τελικής τιμής.

"

# ╔═╡ 962c933e-d5b9-48e1-b9da-f6ce6d190aab
md"#### Παράδειγμα 6

Βρείτε τα χαρακτηρίστηκα απόκρισης της συνάρτησης μεταφοράς: 

$$G(s) = \frac{36}{s^2+3s+36}$$

Καταρχάς βέλπουμε ότι η συνάρτηση είναι της μορφής

$$\frac{ω_n^2}{s^2+2ζω_n+ω_n^2}$$

Άρα $ω_n^2 = 36 \Rightarrow ω_n = 6$, $2ζω_n = 3 \Rightarrow ζ = 0.25$. Επομένως έχουμε

* $t_r =  \frac{1.8}{6} = 0.3s$

* $t_s = \frac{4}{0.25 \times 6} = 2.66s$

* $$M_p = e^{-π0.25/\sqrt{1-0.25^2}}= 0.444$$
"

# ╔═╡ 5ed65649-31a1-46a8-a651-e9422c498af6
G6 = tf([36],[1,3,36])

# ╔═╡ 52c07aeb-f4a6-4298-b526-1e2706a253a0
wn6, zeta6, ps6 = damp(G6) # Returns freq, ζ, poles

# ╔═╡ 18d90467-dd68-4cc7-8d7b-fc2060dc2b8e
tr6 = 1.8/wn6[1]

# ╔═╡ 8219442f-755f-43a6-8c1f-125ed1bfab22
ts6 = 4/(zeta6[1]*wn6[1])

# ╔═╡ c938df9b-0758-4191-a394-f130f1842ba9
Mp6 = exp(-π*zeta6[1]/sqrt(1 - zeta6[1]^2))

# ╔═╡ 370717c2-3eba-41e3-913a-40ab5e788da0
stepplot(G6)

# ╔═╡ 2c6d819e-650e-46df-b2aa-a113c4b0e728
md"#### Παράδειγμα 7

Δίνεται η συνάρτηση μεταφοράς, που περιγράφει τη θέση της κεφαλής σκληρού δίσκου:: 

$$G(s) = \frac{700}{s^2+15s+100000}$$

Μεταβλητή εξόδου είναι η γωνιακή θέση της κεφαλής, (rad) και μεταβλητή εισόδου είναι το ρεύμα που δίνεται στο πηνίο που οδηγεί την κεφαλή, (mA). Θέλουμε να αναλύσουμε τη μεταβατική απόκριση και να δούμε πως μπορεί να βελτιωθεί με την χρήση ελεγκτή. Υπάρχουν δύο πόλοι για το πολυώνυμο 2ου βαθμού της χαρακτηριστικής εξίσωσης.
΄Ετσι έχουμε

"

# ╔═╡ 3649b7f9-c980-404a-9000-9a1b0dd2a20e
G7 = tf([700],[1,15,100000])

# ╔═╡ e177f56e-af05-477e-818b-835a7d02e74e
with_terminal() do
	dampreport(G7)
end

# ╔═╡ 6162a9e5-506b-4595-bc64-aa8e68f5ddb8
md"Παρατηρούμε ότι η απόσβεση έχει πολύ μικρές τιμές, που θα οδηγήσουν σε ταλάντωση
προτού το σύστημα της κεφαλής περιέλθει σε μόνιμη κατάσταση."

# ╔═╡ 6ebbf9cb-5f85-4161-8ef7-35cae4298c6f
stepplot(G7)

# ╔═╡ 668ad3ad-d3c0-4f57-a742-33f87eb868d0
wn7, zeta7, ps7 = damp(G7) # Returns freq, ζ, poles

# ╔═╡ cf6213cb-30e8-46cb-802e-070832a40491
tr7 = 1.8/wn7[1]

# ╔═╡ 640bd42e-7094-4c09-8ec6-db1f2d268822
ts7 = 4/(zeta7[1]*wn7[1])

# ╔═╡ 21d40a07-3d81-485b-bba3-a99640622289
Mp7 = exp(-π*zeta7[1]/sqrt(1 - zeta7[1]^2))

# ╔═╡ c371a5ac-dbe8-4c1c-866b-dd2957e38d9a
md"Βλέπουμε ότι το σύστημα δεν μπορεί να λάβει την επιθυμητή τιμή απόκρισης (=1), εφόσον Peak = 0.0135. Ας δούμε ποιά μπορεί να είναι η επίδραση από τη χρήση ενός συστήματος ελέγχου θέσης της κεφαλής του σκληρού δίσκου, μετρώντας τη θέση σε κλειστό βρόχο. Χρησιμοποιούμε έτσι ελεγκτή τύπου ”αναλογικό-ολοκληρωτικό”, (PI)

$$K(s) = 1 + \frac{1100}{s}$$

δηλ. ως εντολή στο σύστημα ελέγχου δίνεται το γινόμενο (επιθυμητή θέση - τρέχουσα θέση) X K(s). Τοποθετούμε τον ελεγκτή K(s) σε σειρά με το σύστημα G(s) και θέτουμε μοναδιαία ανατροφοδότηση. Η συνάρτηση μεταφοράς κλειστού βρόχου θα είναι

$$G_{CL}(s) = \frac{GK}{1+GK} \Rightarrow G_{CL}(s) = \frac{700s+770000}{s^3 + 15s^2 + 100700s + 770000}$$


Οι παρακάτω εντολές δίνουν την απόκριση του συστήματος ελέγχου σε μοναδιαία βηματική είσοδο
"

# ╔═╡ 28f471b0-39e9-4153-8c80-501fa029a3c9
GCL7 = tf([0, 0, 700, 770000],[1, 15, 100700, 770000])

# ╔═╡ fe87446c-4304-4902-a346-248545ad1186
stepplot(GCL7)

# ╔═╡ Cell order:
# ╟─318d372e-95fe-11eb-290b-29323669eb61
# ╟─18718ccb-103a-41c5-bf3d-3bf79a08d686
# ╠═7c66daef-3998-4357-9a69-4a663b48dff3
# ╟─4db5ab98-4f6a-4f21-ac1a-a1905f4be399
# ╟─e82ebe78-9536-470d-a8cf-154bee32da4c
# ╟─4c677fad-6579-4dcf-a2d6-891a7978a51b
# ╟─9a8462ea-aa6a-47a6-be45-3cbd2072a2aa
# ╟─7b98b638-3d5a-4c65-985a-7eb27a2afeca
# ╠═64a367a6-a104-4564-8860-f958b942474f
# ╟─f0d06d98-8634-49b2-9190-9b06fda0699b
# ╠═18c871fa-e8f2-46e3-a10c-f1f5c5e8498c
# ╟─ea219fad-61fa-4239-ad2e-cfdca9614beb
# ╠═3aa013f5-c9df-44dc-8043-df98573e9db2
# ╟─30fbbcb3-2a3d-4036-800b-d48477ff6713
# ╠═1cbfd3b9-3ac9-449e-adf3-582cdf89cdfe
# ╠═969b4e3b-2ead-4cb5-ab3c-2d39b602e3cf
# ╟─fc83cf82-d257-492b-9890-4b6586a38d4f
# ╠═96b1109e-a77b-4143-b184-857174f2d4a0
# ╟─ceee6016-70aa-467b-a6f9-257ae6f0655e
# ╠═a4509589-3889-4144-bca3-a68e0bfd80fe
# ╠═04580cb4-2576-489e-b06a-fe8a2bf8e800
# ╠═7f06bdd5-9d99-4e04-ad82-d9be2c7b1541
# ╠═38e62cbb-706b-4015-bc57-0a05a2e49d76
# ╠═624c0572-fac2-4d9b-bfc2-fa737174ea72
# ╟─a716a4bc-5994-4601-be34-2b1e96579900
# ╟─4636c254-5f4b-44f2-8c67-4145ca3891e5
# ╟─962c933e-d5b9-48e1-b9da-f6ce6d190aab
# ╠═5ed65649-31a1-46a8-a651-e9422c498af6
# ╠═52c07aeb-f4a6-4298-b526-1e2706a253a0
# ╠═18d90467-dd68-4cc7-8d7b-fc2060dc2b8e
# ╠═8219442f-755f-43a6-8c1f-125ed1bfab22
# ╠═c938df9b-0758-4191-a394-f130f1842ba9
# ╠═370717c2-3eba-41e3-913a-40ab5e788da0
# ╟─2c6d819e-650e-46df-b2aa-a113c4b0e728
# ╠═3649b7f9-c980-404a-9000-9a1b0dd2a20e
# ╠═e177f56e-af05-477e-818b-835a7d02e74e
# ╟─6162a9e5-506b-4595-bc64-aa8e68f5ddb8
# ╠═6ebbf9cb-5f85-4161-8ef7-35cae4298c6f
# ╠═668ad3ad-d3c0-4f57-a742-33f87eb868d0
# ╠═cf6213cb-30e8-46cb-802e-070832a40491
# ╠═640bd42e-7094-4c09-8ec6-db1f2d268822
# ╠═21d40a07-3d81-485b-bba3-a99640622289
# ╟─c371a5ac-dbe8-4c1c-866b-dd2957e38d9a
# ╠═28f471b0-39e9-4153-8c80-501fa029a3c9
# ╠═fe87446c-4304-4902-a346-248545ad1186
